Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/17/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-Cn63G1kDicGUTXQp

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...
module.kubernetes.module.grafana.helm_release.grafana: Drift detected (delete)
module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespaceOverride: grafana
            EOT,
        ]
      + verify                     = false
      + version                    = "6.61.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-ingress will be created
  + resource "kubernetes_manifest" "grafana-ingress" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + name      = "grafana-ingress"
              + namespace = "grafana"
            }
          + spec       = {
              + entryPoints = [
                  + "web",
                ]
              + routes      = [
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/grafana`)"
                      + middlewares = [
                          + {
                              + name = "stripprefix-grafana"
                            },
                        ]
                      + services    = [
                          + {
                              + name = "grafana"
                              + port = 80
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "IngressRoute"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-ingress"
              + namespace                  = "grafana"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + entryPoints = [
                  + "web",
                ]
              + routes      = [
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/grafana`)"
                      + middlewares = [
                          + {
                              + name      = "stripprefix-grafana"
                              + namespace = (known after apply)
                            },
                        ]
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = (known after apply)
                              + name               = "grafana"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "80"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = (known after apply)
                              + serversTransport   = (known after apply)
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
              + tls         = {
                  + certResolver = (known after apply)
                  + domains      = (known after apply)
                  + options      = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                  + secretName   = (known after apply)
                  + store        = {
                      + name      = (known after apply)
                      + namespace = (known after apply)
                    }
                }
            }
        }
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-ingress-middleware will be created
  + resource "kubernetes_manifest" "grafana-ingress-middleware" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "stripprefix-grafana"
              + namespace = "grafana"
            }
          + spec       = {
              + stripPrefix = {
                  + prefixes = [
                      + "/grafana",
                    ]
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "stripprefix-grafana"
              + namespace                  = "grafana"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                }
              + compress          = {
                  + excludedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query   = (known after apply)
                  + service = {
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + httpOnly = (known after apply)
                              + name     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status  = (known after apply)
                }
              + forwardAuth       = {
                  + address                  = (known after apply)
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = (known after apply)
                  + authResponseHeadersRegex = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = [
                      + "/grafana",
                    ]
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-namespace will be created
  + resource "kubernetes_manifest" "grafana-namespace" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + name = "grafana"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Namespace"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana"
              + namespace                  = (known after apply)
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + finalizers = (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>